Revit 2024 API
Fascia.FasciaType Property
Retrieves/set an object that represents the type of the Fascia.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FasciaType FasciaType { get; set; }
Visual Basic
Public Property FasciaType As FasciaType
	Get
	Set
Visual C++
public:
property FasciaType^ FasciaType {
	FasciaType^ get ();
	void set (FasciaType^ value);
}
See Also
Fascia Class
Autodesk.Revit.DB.Architecture Namespace